version 1.0;

graph main_graph(external1) -> (concat21, concat26, concat30)
{
    external1 = external<scalar>(shape = [1, 3, 640, 640]);
    variable1 = variable<scalar>(shape = [32, 3, 3, 3], label = 'variable1');
    variable2 = variable<scalar>(shape = [1, 32], label = 'variable2');
    variable3 = variable<scalar>(shape = [64, 32, 3, 3], label = 'variable3');
    variable4 = variable<scalar>(shape = [1, 64], label = 'variable4');
    variable5 = variable<scalar>(shape = [64, 64, 1, 1], label = 'variable5');
    variable6 = variable<scalar>(shape = [1, 64], label = 'variable6');
    variable7 = variable<scalar>(shape = [32, 32, 3, 3], label = 'variable7');
    variable8 = variable<scalar>(shape = [1, 32], label = 'variable8');
    variable9 = variable<scalar>(shape = [32, 32, 3, 3], label = 'variable9');
    variable10 = variable<scalar>(shape = [1, 32], label = 'variable10');
    variable11 = variable<scalar>(shape = [64, 96, 1, 1], label = 'variable11');
    variable12 = variable<scalar>(shape = [1, 64], label = 'variable12');
    variable13 = variable<scalar>(shape = [128, 64, 3, 3], label = 'variable13');
    variable14 = variable<scalar>(shape = [1, 128], label = 'variable14');
    variable15 = variable<scalar>(shape = [128, 128, 1, 1], label = 'variable15');
    variable16 = variable<scalar>(shape = [1, 128], label = 'variable16');
    variable17 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable17');
    variable18 = variable<scalar>(shape = [1, 64], label = 'variable18');
    variable19 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable19');
    variable20 = variable<scalar>(shape = [1, 64], label = 'variable20');
    variable21 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable21');
    variable22 = variable<scalar>(shape = [1, 64], label = 'variable22');
    variable23 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable23');
    variable24 = variable<scalar>(shape = [1, 64], label = 'variable24');
    variable25 = variable<scalar>(shape = [128, 256, 1, 1], label = 'variable25');
    variable26 = variable<scalar>(shape = [1, 128], label = 'variable26');
    variable27 = variable<scalar>(shape = [256, 128, 3, 3], label = 'variable27');
    variable28 = variable<scalar>(shape = [1, 256], label = 'variable28');
    variable29 = variable<scalar>(shape = [256, 256, 1, 1], label = 'variable29');
    variable30 = variable<scalar>(shape = [1, 256], label = 'variable30');
    variable31 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable31');
    variable32 = variable<scalar>(shape = [1, 128], label = 'variable32');
    variable33 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable33');
    variable34 = variable<scalar>(shape = [1, 128], label = 'variable34');
    variable35 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable35');
    variable36 = variable<scalar>(shape = [1, 128], label = 'variable36');
    variable37 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable37');
    variable38 = variable<scalar>(shape = [1, 128], label = 'variable38');
    variable39 = variable<scalar>(shape = [256, 512, 1, 1], label = 'variable39');
    variable40 = variable<scalar>(shape = [1, 256], label = 'variable40');
    variable41 = variable<scalar>(shape = [512, 256, 3, 3], label = 'variable41');
    variable42 = variable<scalar>(shape = [1, 512], label = 'variable42');
    variable43 = variable<scalar>(shape = [512, 512, 1, 1], label = 'variable43');
    variable44 = variable<scalar>(shape = [1, 512], label = 'variable44');
    variable45 = variable<scalar>(shape = [256, 256, 3, 3], label = 'variable45');
    variable46 = variable<scalar>(shape = [1, 256], label = 'variable46');
    variable47 = variable<scalar>(shape = [256, 256, 3, 3], label = 'variable47');
    variable48 = variable<scalar>(shape = [1, 256], label = 'variable48');
    variable49 = variable<scalar>(shape = [512, 768, 1, 1], label = 'variable49');
    variable50 = variable<scalar>(shape = [1, 512], label = 'variable50');
    variable51 = variable<scalar>(shape = [256, 512, 1, 1], label = 'variable51');
    variable52 = variable<scalar>(shape = [1, 256], label = 'variable52');
    variable53 = variable<scalar>(shape = [512, 1024, 1, 1], label = 'variable53');
    variable54 = variable<scalar>(shape = [1, 512], label = 'variable54');
    variable55 = variable<scalar>(shape = [128, 768, 1, 1], label = 'variable55');
    variable56 = variable<scalar>(shape = [1, 128], label = 'variable56');
    variable57 = variable<scalar>(shape = [128, 768, 1, 1], label = 'variable57');
    variable58 = variable<scalar>(shape = [1, 128], label = 'variable58');
    variable59 = variable<scalar>(shape = [32, 128, 1, 1], label = 'variable59');
    variable60 = variable<scalar>(shape = [1, 32], label = 'variable60');
    variable61 = variable<scalar>(shape = [32, 1, 5, 5], label = 'variable61');
    variable62 = variable<scalar>(shape = [1, 32], label = 'variable62');
    variable63 = variable<scalar>(shape = [64, 64, 1, 1], label = 'variable63');
    variable64 = variable<scalar>(shape = [1, 64], label = 'variable64');
    variable65 = variable<scalar>(shape = [64, 1, 5, 5], label = 'variable65');
    variable66 = variable<scalar>(shape = [1, 64], label = 'variable66');
    variable67 = variable<scalar>(shape = [256, 256, 1, 1], label = 'variable67');
    variable68 = variable<scalar>(shape = [1, 256], label = 'variable68');
    variable69 = variable<scalar>(shape = [64, 384, 1, 1], label = 'variable69');
    variable70 = variable<scalar>(shape = [1, 64], label = 'variable70');
    variable71 = variable<scalar>(shape = [64, 384, 1, 1], label = 'variable71');
    variable72 = variable<scalar>(shape = [1, 64], label = 'variable72');
    variable73 = variable<scalar>(shape = [16, 64, 1, 1], label = 'variable73');
    variable74 = variable<scalar>(shape = [1, 16], label = 'variable74');
    variable75 = variable<scalar>(shape = [16, 1, 5, 5], label = 'variable75');
    variable76 = variable<scalar>(shape = [1, 16], label = 'variable76');
    variable77 = variable<scalar>(shape = [32, 32, 1, 1], label = 'variable77');
    variable78 = variable<scalar>(shape = [1, 32], label = 'variable78');
    variable79 = variable<scalar>(shape = [32, 1, 5, 5], label = 'variable79');
    variable80 = variable<scalar>(shape = [1, 32], label = 'variable80');
    variable81 = variable<scalar>(shape = [128, 128, 1, 1], label = 'variable81');
    variable82 = variable<scalar>(shape = [1, 128], label = 'variable82');
    variable83 = variable<scalar>(shape = [64, 192, 1, 1], label = 'variable83');
    variable84 = variable<scalar>(shape = [1, 64], label = 'variable84');
    variable85 = variable<scalar>(shape = [32, 32, 3, 3], label = 'variable85');
    variable86 = variable<scalar>(shape = [1, 32], label = 'variable86');
    variable87 = variable<scalar>(shape = [32, 32, 3, 3], label = 'variable87');
    variable88 = variable<scalar>(shape = [1, 32], label = 'variable88');
    variable89 = variable<scalar>(shape = [64, 96, 1, 1], label = 'variable89');
    variable90 = variable<scalar>(shape = [1, 64], label = 'variable90');
    variable91 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable91');
    variable92 = variable<scalar>(shape = [1, 64], label = 'variable92');
    variable93 = variable<scalar>(shape = [64, 1, 5, 5], label = 'variable93');
    variable94 = variable<scalar>(shape = [1, 64], label = 'variable94');
    variable95 = variable<scalar>(shape = [64, 256, 1, 1], label = 'variable95');
    variable96 = variable<scalar>(shape = [1, 64], label = 'variable96');
    variable97 = variable<scalar>(shape = [64, 256, 1, 1], label = 'variable97');
    variable98 = variable<scalar>(shape = [1, 64], label = 'variable98');
    variable99 = variable<scalar>(shape = [16, 64, 1, 1], label = 'variable99');
    variable100 = variable<scalar>(shape = [1, 16], label = 'variable100');
    variable101 = variable<scalar>(shape = [16, 1, 5, 5], label = 'variable101');
    variable102 = variable<scalar>(shape = [1, 16], label = 'variable102');
    variable103 = variable<scalar>(shape = [32, 32, 1, 1], label = 'variable103');
    variable104 = variable<scalar>(shape = [1, 32], label = 'variable104');
    variable105 = variable<scalar>(shape = [32, 1, 5, 5], label = 'variable105');
    variable106 = variable<scalar>(shape = [1, 32], label = 'variable106');
    variable107 = variable<scalar>(shape = [128, 128, 1, 1], label = 'variable107');
    variable108 = variable<scalar>(shape = [1, 128], label = 'variable108');
    variable109 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable109');
    variable110 = variable<scalar>(shape = [1, 128], label = 'variable110');
    variable111 = variable<scalar>(shape = [64, 128, 3, 3], label = 'variable111');
    variable112 = variable<scalar>(shape = [1, 64], label = 'variable112');
    variable113 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable113');
    variable114 = variable<scalar>(shape = [1, 128], label = 'variable114');
    variable115 = variable<scalar>(shape = [128, 1, 5, 5], label = 'variable115');
    variable116 = variable<scalar>(shape = [1, 128], label = 'variable116');
    variable117 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable117');
    variable118 = variable<scalar>(shape = [1, 64], label = 'variable118');
    variable119 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable119');
    variable120 = variable<scalar>(shape = [1, 128], label = 'variable120');
    variable121 = variable<scalar>(shape = [64, 64, 1, 1], label = 'variable121');
    variable122 = variable<scalar>(shape = [1, 64], label = 'variable122');
    variable123 = variable<scalar>(shape = [6, 128, 1, 1], label = 'variable123');
    variable124 = variable<scalar>(shape = [1, 6], label = 'variable124');
    variable125 = variable<scalar>(shape = [128, 512, 1, 1], label = 'variable125');
    variable126 = variable<scalar>(shape = [1, 128], label = 'variable126');
    variable127 = variable<scalar>(shape = [128, 512, 1, 1], label = 'variable127');
    variable128 = variable<scalar>(shape = [1, 128], label = 'variable128');
    variable129 = variable<scalar>(shape = [32, 128, 1, 1], label = 'variable129');
    variable130 = variable<scalar>(shape = [1, 32], label = 'variable130');
    variable131 = variable<scalar>(shape = [32, 1, 5, 5], label = 'variable131');
    variable132 = variable<scalar>(shape = [1, 32], label = 'variable132');
    variable133 = variable<scalar>(shape = [64, 64, 1, 1], label = 'variable133');
    variable134 = variable<scalar>(shape = [1, 64], label = 'variable134');
    variable135 = variable<scalar>(shape = [64, 1, 5, 5], label = 'variable135');
    variable136 = variable<scalar>(shape = [1, 64], label = 'variable136');
    variable137 = variable<scalar>(shape = [256, 256, 1, 1], label = 'variable137');
    variable138 = variable<scalar>(shape = [1, 256], label = 'variable138');
    variable139 = variable<scalar>(shape = [256, 256, 3, 3], label = 'variable139');
    variable140 = variable<scalar>(shape = [1, 256], label = 'variable140');
    variable141 = variable<scalar>(shape = [64, 256, 3, 3], label = 'variable141');
    variable142 = variable<scalar>(shape = [1, 64], label = 'variable142');
    variable143 = variable<scalar>(shape = [128, 256, 3, 3], label = 'variable143');
    variable144 = variable<scalar>(shape = [1, 128], label = 'variable144');
    variable145 = variable<scalar>(shape = [256, 1, 5, 5], label = 'variable145');
    variable146 = variable<scalar>(shape = [1, 256], label = 'variable146');
    variable147 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable147');
    variable148 = variable<scalar>(shape = [1, 64], label = 'variable148');
    variable149 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable149');
    variable150 = variable<scalar>(shape = [1, 128], label = 'variable150');
    variable151 = variable<scalar>(shape = [64, 64, 1, 1], label = 'variable151');
    variable152 = variable<scalar>(shape = [1, 64], label = 'variable152');
    variable153 = variable<scalar>(shape = [6, 128, 1, 1], label = 'variable153');
    variable154 = variable<scalar>(shape = [1, 6], label = 'variable154');
    variable155 = variable<scalar>(shape = [256, 1024, 1, 1], label = 'variable155');
    variable156 = variable<scalar>(shape = [1, 256], label = 'variable156');
    variable157 = variable<scalar>(shape = [256, 1024, 1, 1], label = 'variable157');
    variable158 = variable<scalar>(shape = [1, 256], label = 'variable158');
    variable159 = variable<scalar>(shape = [64, 256, 1, 1], label = 'variable159');
    variable160 = variable<scalar>(shape = [1, 64], label = 'variable160');
    variable161 = variable<scalar>(shape = [64, 1, 5, 5], label = 'variable161');
    variable162 = variable<scalar>(shape = [1, 64], label = 'variable162');
    variable163 = variable<scalar>(shape = [128, 128, 1, 1], label = 'variable163');
    variable164 = variable<scalar>(shape = [1, 128], label = 'variable164');
    variable165 = variable<scalar>(shape = [128, 1, 5, 5], label = 'variable165');
    variable166 = variable<scalar>(shape = [1, 128], label = 'variable166');
    variable167 = variable<scalar>(shape = [512, 512, 1, 1], label = 'variable167');
    variable168 = variable<scalar>(shape = [1, 512], label = 'variable168');
    variable169 = variable<scalar>(shape = [64, 512, 3, 3], label = 'variable169');
    variable170 = variable<scalar>(shape = [1, 64], label = 'variable170');
    variable171 = variable<scalar>(shape = [128, 512, 3, 3], label = 'variable171');
    variable172 = variable<scalar>(shape = [1, 128], label = 'variable172');
    variable173 = variable<scalar>(shape = [64, 64, 3, 3], label = 'variable173');
    variable174 = variable<scalar>(shape = [1, 64], label = 'variable174');
    variable175 = variable<scalar>(shape = [128, 128, 3, 3], label = 'variable175');
    variable176 = variable<scalar>(shape = [1, 128], label = 'variable176');
    variable177 = variable<scalar>(shape = [64, 64, 1, 1], label = 'variable177');
    variable178 = variable<scalar>(shape = [1, 64], label = 'variable178');
    variable179 = variable<scalar>(shape = [6, 128, 1, 1], label = 'variable179');
    variable180 = variable<scalar>(shape = [1, 6], label = 'variable180');
    conv1 = conv(external1, variable1, variable2, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid1 = sigmoid(conv1);
    mul1 = mul(conv1, sigmoid1);
    conv2 = conv(mul1, variable3, variable4, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid2 = sigmoid(conv2);
    mul2 = mul(conv2, sigmoid2);
    conv3 = conv(mul2, variable5, variable6, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid3 = sigmoid(conv3);
    mul3 = mul(conv3, sigmoid3);
    [split1, split2] = split(mul3, axis = 1, ratios = [32, 32]);
    conv4 = conv(split2, variable7, variable8, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid4 = sigmoid(conv4);
    mul4 = mul(conv4, sigmoid4);
    conv5 = conv(mul4, variable9, variable10, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid5 = sigmoid(conv5);
    mul5 = mul(conv5, sigmoid5);
    add1 = add(split2, mul5);
    concat1 = concat([split1, split2, add1], axis = 1);
    conv6 = conv(concat1, variable11, variable12, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid6 = sigmoid(conv6);
    mul6 = mul(conv6, sigmoid6);
    conv7 = conv(mul6, variable13, variable14, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid7 = sigmoid(conv7);
    mul7 = mul(conv7, sigmoid7);
    conv8 = conv(mul7, variable15, variable16, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid8 = sigmoid(conv8);
    mul8 = mul(conv8, sigmoid8);
    [split3, split4] = split(mul8, axis = 1, ratios = [64, 64]);
    conv9 = conv(split4, variable17, variable18, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid9 = sigmoid(conv9);
    mul9 = mul(conv9, sigmoid9);
    conv10 = conv(mul9, variable19, variable20, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid10 = sigmoid(conv10);
    mul10 = mul(conv10, sigmoid10);
    add2 = add(split4, mul10);
    conv11 = conv(add2, variable21, variable22, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid11 = sigmoid(conv11);
    mul11 = mul(conv11, sigmoid11);
    conv12 = conv(mul11, variable23, variable24, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid12 = sigmoid(conv12);
    mul12 = mul(conv12, sigmoid12);
    add3 = add(add2, mul12);
    concat2 = concat([split3, split4, add2, add3], axis = 1);
    conv13 = conv(concat2, variable25, variable26, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid13 = sigmoid(conv13);
    mul13 = mul(conv13, sigmoid13);
    conv14 = conv(mul13, variable27, variable28, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid14 = sigmoid(conv14);
    mul14 = mul(conv14, sigmoid14);
    conv15 = conv(mul14, variable29, variable30, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid15 = sigmoid(conv15);
    mul15 = mul(conv15, sigmoid15);
    [split5, split6] = split(mul15, axis = 1, ratios = [128, 128]);
    conv16 = conv(split6, variable31, variable32, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid16 = sigmoid(conv16);
    mul16 = mul(conv16, sigmoid16);
    conv17 = conv(mul16, variable33, variable34, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid17 = sigmoid(conv17);
    mul17 = mul(conv17, sigmoid17);
    add4 = add(split6, mul17);
    conv18 = conv(add4, variable35, variable36, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid18 = sigmoid(conv18);
    mul18 = mul(conv18, sigmoid18);
    conv19 = conv(mul18, variable37, variable38, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid19 = sigmoid(conv19);
    mul19 = mul(conv19, sigmoid19);
    add5 = add(add4, mul19);
    concat3 = concat([split5, split6, add4, add5], axis = 1);
    conv20 = conv(concat3, variable39, variable40, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid20 = sigmoid(conv20);
    mul20 = mul(conv20, sigmoid20);
    conv21 = conv(mul20, variable41, variable42, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid21 = sigmoid(conv21);
    mul21 = mul(conv21, sigmoid21);
    conv22 = conv(mul21, variable43, variable44, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid22 = sigmoid(conv22);
    mul22 = mul(conv22, sigmoid22);
    [split7, split8] = split(mul22, axis = 1, ratios = [256, 256]);
    conv23 = conv(split8, variable45, variable46, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid23 = sigmoid(conv23);
    mul23 = mul(conv23, sigmoid23);
    conv24 = conv(mul23, variable47, variable48, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid24 = sigmoid(conv24);
    mul24 = mul(conv24, sigmoid24);
    add6 = add(split8, mul24);
    concat4 = concat([split7, split8, add6], axis = 1);
    conv25 = conv(concat4, variable49, variable50, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid25 = sigmoid(conv25);
    mul25 = mul(conv25, sigmoid25);
    conv26 = conv(mul25, variable51, variable52, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid26 = sigmoid(conv26);
    mul26 = mul(conv26, sigmoid26);
    max_pool1 = max_pool(mul26, size = [1, 1, 5, 5], stride = [1, 1, 1, 1], dilation = [1, 1, 1, 1], padding = [(0, 0), (0, 0), (2, 2), (2, 2)], border = 'ignore');
    max_pool2 = max_pool(max_pool1, size = [1, 1, 5, 5], stride = [1, 1, 1, 1], dilation = [1, 1, 1, 1], padding = [(0, 0), (0, 0), (2, 2), (2, 2)], border = 'ignore');
    max_pool3 = max_pool(max_pool2, size = [1, 1, 5, 5], stride = [1, 1, 1, 1], dilation = [1, 1, 1, 1], padding = [(0, 0), (0, 0), (2, 2), (2, 2)], border = 'ignore');
    concat5 = concat([mul26, max_pool1, max_pool2, max_pool3], axis = 1);
    conv27 = conv(concat5, variable53, variable54, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid27 = sigmoid(conv27);
    mul27 = mul(conv27, sigmoid27);
    nearest_upsample1 = nearest_upsample(mul27, factor = [2, 2]);
    concat6 = concat([nearest_upsample1, mul20], axis = 1);
    conv28 = conv(concat6, variable55, variable56, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv29 = conv(concat6, variable57, variable58, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid28 = sigmoid(conv28);
    sigmoid29 = sigmoid(conv29);
    mul28 = mul(conv28, sigmoid28);
    mul29 = mul(conv29, sigmoid29);
    conv30 = conv(mul28, variable59, variable60, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid30 = sigmoid(conv30);
    mul30 = mul(conv30, sigmoid30);
    conv31 = conv(mul30, variable61, variable62, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 32);
    sigmoid31 = sigmoid(conv31);
    mul31 = mul(conv31, sigmoid31);
    concat7 = concat([mul30, mul31], axis = 1);
    conv32 = conv(concat7, variable63, variable64, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv33 = conv(conv32, variable65, variable66, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 64);
    concat8 = concat([conv32, conv33], axis = 1);
    add7 = add(concat8, mul28);
    concat9 = concat([add7, mul29], axis = 1);
    conv34 = conv(concat9, variable67, variable68, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid32 = sigmoid(conv34);
    mul32 = mul(conv34, sigmoid32);
    nearest_upsample2 = nearest_upsample(mul32, factor = [2, 2]);
    concat10 = concat([nearest_upsample2, mul13], axis = 1);
    conv35 = conv(concat10, variable69, variable70, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv36 = conv(concat10, variable71, variable72, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid33 = sigmoid(conv35);
    sigmoid34 = sigmoid(conv36);
    mul33 = mul(conv35, sigmoid33);
    mul34 = mul(conv36, sigmoid34);
    conv37 = conv(mul33, variable73, variable74, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid35 = sigmoid(conv37);
    mul35 = mul(conv37, sigmoid35);
    conv38 = conv(mul35, variable75, variable76, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 16);
    sigmoid36 = sigmoid(conv38);
    mul36 = mul(conv38, sigmoid36);
    concat11 = concat([mul35, mul36], axis = 1);
    conv39 = conv(concat11, variable77, variable78, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv40 = conv(conv39, variable79, variable80, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 32);
    concat12 = concat([conv39, conv40], axis = 1);
    add8 = add(concat12, mul33);
    concat13 = concat([add8, mul34], axis = 1);
    conv41 = conv(concat13, variable81, variable82, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid37 = sigmoid(conv41);
    mul37 = mul(conv41, sigmoid37);
    nearest_upsample3 = nearest_upsample(mul37, factor = [2, 2]);
    concat14 = concat([nearest_upsample3, mul6], axis = 1);
    conv42 = conv(concat14, variable83, variable84, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid38 = sigmoid(conv42);
    mul38 = mul(conv42, sigmoid38);
    [split9, split10] = split(mul38, axis = 1, ratios = [32, 32]);
    conv43 = conv(split10, variable85, variable86, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid39 = sigmoid(conv43);
    mul39 = mul(conv43, sigmoid39);
    conv44 = conv(mul39, variable87, variable88, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid40 = sigmoid(conv44);
    mul40 = mul(conv44, sigmoid40);
    concat15 = concat([split9, split10, mul40], axis = 1);
    conv45 = conv(concat15, variable89, variable90, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid41 = sigmoid(conv45);
    mul41 = mul(conv45, sigmoid41);
    conv46 = conv(mul41, variable91, variable92, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid42 = sigmoid(conv46);
    mul42 = mul(conv46, sigmoid42);
    conv47 = conv(mul42, variable93, variable94, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 64);
    sigmoid43 = sigmoid(conv47);
    mul43 = mul(conv47, sigmoid43);
    concat16 = concat([mul42, mul43, mul37], axis = 1);
    conv48 = conv(concat16, variable95, variable96, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv49 = conv(concat16, variable97, variable98, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid44 = sigmoid(conv48);
    sigmoid45 = sigmoid(conv49);
    mul44 = mul(conv48, sigmoid44);
    mul45 = mul(conv49, sigmoid45);
    conv50 = conv(mul44, variable99, variable100, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid46 = sigmoid(conv50);
    mul46 = mul(conv50, sigmoid46);
    conv51 = conv(mul46, variable101, variable102, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 16);
    sigmoid47 = sigmoid(conv51);
    mul47 = mul(conv51, sigmoid47);
    concat17 = concat([mul46, mul47], axis = 1);
    conv52 = conv(concat17, variable103, variable104, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv53 = conv(conv52, variable105, variable106, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 32);
    concat18 = concat([conv52, conv53], axis = 1);
    add9 = add(concat18, mul44);
    concat19 = concat([add9, mul45], axis = 1);
    conv54 = conv(concat19, variable107, variable108, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid48 = sigmoid(conv54);
    mul48 = mul(conv54, sigmoid48);
    conv55 = conv(mul48, variable109, variable110, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv56 = conv(mul48, variable111, variable112, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv57 = conv(mul48, variable113, variable114, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid49 = sigmoid(conv55);
    sigmoid50 = sigmoid(conv56);
    sigmoid51 = sigmoid(conv57);
    mul49 = mul(conv55, sigmoid49);
    mul50 = mul(conv56, sigmoid50);
    mul51 = mul(conv57, sigmoid51);
    conv58 = conv(mul49, variable115, variable116, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 128);
    conv59 = conv(mul50, variable117, variable118, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv60 = conv(mul51, variable119, variable120, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid52 = sigmoid(conv58);
    sigmoid53 = sigmoid(conv59);
    sigmoid54 = sigmoid(conv60);
    mul52 = mul(conv58, sigmoid52);
    mul53 = mul(conv59, sigmoid53);
    mul54 = mul(conv60, sigmoid54);
    concat20 = concat([mul49, mul52, mul32], axis = 1);
    conv61 = conv(mul53, variable121, variable122, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv62 = conv(mul54, variable123, variable124, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv63 = conv(concat20, variable125, variable126, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv64 = conv(concat20, variable127, variable128, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    concat21 = concat([conv61, conv62], axis = 1);
    sigmoid55 = sigmoid(conv63);
    sigmoid56 = sigmoid(conv64);
    mul55 = mul(conv63, sigmoid55);
    mul56 = mul(conv64, sigmoid56);
    conv65 = conv(mul55, variable129, variable130, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid57 = sigmoid(conv65);
    mul57 = mul(conv65, sigmoid57);
    conv66 = conv(mul57, variable131, variable132, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 32);
    sigmoid58 = sigmoid(conv66);
    mul58 = mul(conv66, sigmoid58);
    concat22 = concat([mul57, mul58], axis = 1);
    conv67 = conv(concat22, variable133, variable134, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv68 = conv(conv67, variable135, variable136, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 64);
    concat23 = concat([conv67, conv68], axis = 1);
    add10 = add(concat23, mul55);
    concat24 = concat([add10, mul56], axis = 1);
    conv69 = conv(concat24, variable137, variable138, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid59 = sigmoid(conv69);
    mul59 = mul(conv69, sigmoid59);
    conv70 = conv(mul59, variable139, variable140, stride = [2, 2], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv71 = conv(mul59, variable141, variable142, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv72 = conv(mul59, variable143, variable144, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid60 = sigmoid(conv70);
    sigmoid61 = sigmoid(conv71);
    sigmoid62 = sigmoid(conv72);
    mul60 = mul(conv70, sigmoid60);
    mul61 = mul(conv71, sigmoid61);
    mul62 = mul(conv72, sigmoid62);
    conv73 = conv(mul60, variable145, variable146, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 256);
    conv74 = conv(mul61, variable147, variable148, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv75 = conv(mul62, variable149, variable150, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid63 = sigmoid(conv73);
    sigmoid64 = sigmoid(conv74);
    sigmoid65 = sigmoid(conv75);
    mul63 = mul(conv73, sigmoid63);
    mul64 = mul(conv74, sigmoid64);
    mul65 = mul(conv75, sigmoid65);
    concat25 = concat([mul60, mul63, mul27], axis = 1);
    conv76 = conv(mul64, variable151, variable152, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv77 = conv(mul65, variable153, variable154, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv78 = conv(concat25, variable155, variable156, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv79 = conv(concat25, variable157, variable158, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    concat26 = concat([conv76, conv77], axis = 1);
    sigmoid66 = sigmoid(conv78);
    sigmoid67 = sigmoid(conv79);
    mul66 = mul(conv78, sigmoid66);
    mul67 = mul(conv79, sigmoid67);
    conv80 = conv(mul66, variable159, variable160, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid68 = sigmoid(conv80);
    mul68 = mul(conv80, sigmoid68);
    conv81 = conv(mul68, variable161, variable162, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 64);
    sigmoid69 = sigmoid(conv81);
    mul69 = mul(conv81, sigmoid69);
    concat27 = concat([mul68, mul69], axis = 1);
    conv82 = conv(concat27, variable163, variable164, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv83 = conv(conv82, variable165, variable166, stride = [1, 1], dilation = [1, 1], padding = [(2, 2), (2, 2)], groups = 128);
    concat28 = concat([conv82, conv83], axis = 1);
    add11 = add(concat28, mul66);
    concat29 = concat([add11, mul67], axis = 1);
    conv84 = conv(concat29, variable167, variable168, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    sigmoid70 = sigmoid(conv84);
    mul70 = mul(conv84, sigmoid70);
    conv85 = conv(mul70, variable169, variable170, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv86 = conv(mul70, variable171, variable172, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid71 = sigmoid(conv85);
    sigmoid72 = sigmoid(conv86);
    mul71 = mul(conv85, sigmoid71);
    mul72 = mul(conv86, sigmoid72);
    conv87 = conv(mul71, variable173, variable174, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    conv88 = conv(mul72, variable175, variable176, stride = [1, 1], dilation = [1, 1], padding = [(1, 1), (1, 1)], groups = 1);
    sigmoid73 = sigmoid(conv87);
    sigmoid74 = sigmoid(conv88);
    mul73 = mul(conv87, sigmoid73);
    mul74 = mul(conv88, sigmoid74);
    conv89 = conv(mul73, variable177, variable178, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    conv90 = conv(mul74, variable179, variable180, stride = [1, 1], dilation = [1, 1], padding = [(0, 0), (0, 0)], groups = 1);
    concat30 = concat([conv89, conv90], axis = 1);
}
