# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.33, 0.25, 1024]
  s: [0.33, 0.40, 1024]
  # m: [0.67, 0.75, 768]
  # l: [1.00, 1.00, 512]
  # x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 6, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4 + P5 = (1536, 40, 40) #11
  - [-1, 3, C3Ghost, [512, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3 + (P4 + P5) = (768, 80, 80)
  - [-1, 3, C3Ghost, [256, False]] # 15 (P3/8-small) 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 2], 1, Concat, [1]] # 17 cat backbone P2 + (P3 + (P4 + P5)) = (128, 160, 160)
  - [-1, 3, C3Ghost, [128, False]] # 18 (P2/4-xsmall)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [-1, 3, C3Ghost, [64, False]] # 20 (P2/4-xsmall)
  - [-1, 1, GhostConv, [64, 3, 2]] # 21 -> (128, 80, 80)
  - [-1, 1, GhostConv, [128, 3, 2]] # 22 -> (128, 80, 80)

  - [18, 1, GhostConv, [128, 3, 2]] # 23 -> (128, 80, 80)
  - [[-1, 15, 22], 1, Concat, [1]] # 24 cat head P3
  - [-1, 3, C3Ghost, [256], False] # 25 (P3/8-small) -> (256, 80, 80)

  - [-1, 1, GhostConv, [256, 3, 2]]  # 26
  - [[-1, 12], 1, Concat, [1]] # 27 cat head P4
  - [-1, 3, C3Ghost, [512, False]] # 28 (P4/16-medium)

  - [-1, 1, GhostConv, [512, 3, 2]] # 29
  - [[-1, 9], 1, Concat, [1]] # 30 cat head P5
  - [-1, 3, C3Ghost, [1024, False]] # 31 (P5/32-large)

  - [[25, 28, 31], 1, Detect, [nc]] # Detect(P3, P4, P5)
